Repository: wofr06/marblerun
Catalog: lib/Game/MarbleRun/I18N/*.po
Languages: de

source: Height Tile small
de: Höhenstein klein

source: Height Tile large
de: Höhenstein groß

source: Height tile 2 units
de: Höhenstein x 2

source: Height tile 3 units
de: Höhenstein x 3

source: Height tile 4 units
de: Höhenstein x 4

source: Height tile 5 units
de: Höhenstein x 5

source: Height tile 6 units
de: Höhenstein x 6

source: Height tile 7 units
de: Höhenstein x 7

source: Height tile 8 units
de: Höhenstein x 8

source: Height tile 9 units
de: Höhenstein x 9

source: Small Transparent Level
de: kleine transparente Ebene

source: Small Base Plate
de: Kleine Bodenplatte

source: Launch Pad
de: Start

source: Balcony
de: Balkon

source: Curve
de: Kurve

source: Freefall (Drop)
de: Freifall

source: Double Balcony
de: Doppelbalkon

source: Flipper
de: Flip

source: Catcher
de: Fänger

source: Tunnel Straight
de: Tunnel gerade

source: Scoop
de: Kaskade

source: Pillar
de: Säule

source: Magnetic Cannon
de: Gaußkanone

source: Volcano
de: Vulkan

source: Open Basket
de: Auffangkorb

source: Trampoline
de: Trampolin

source: Switch
de: Weiche

source: Tunnel Curve
de: Tunnelkurve

source: Tunnel Switch
de: Tunnelweiche

source: Vortex
de: Wirbel

source: Junction
de: Kreuzung

source: Landing
de: Ziel

source: Transparent Level
de: Transparente Ebene

source: Base Plate
de: Bodenplatte

source: Rail Bernoulli short
de: Schiene gebogen kurz

source: Rail Bernoulli
de: Schiene gebogen

source: Rail counter clockwise
de: Schiene gebogen minus

source: Rail clockwise
de: Schiene gebogen plus

source: Finish Line
de: Zielleiter

source: Lift Tube Element
de: Lift Röhre

source: Rail Overlong
de: Schiene extralang

source: Spiral Curve
de: Spirale Kurve

source: Spiral in
de: Spirale Start

source: Spiral out
de: Spirale Auslauf

source: Rail Long
de: Schiene lang

source: Rail Medium
de: Schiene mittel

source: Ball
de: Kugel

source: Rail Overlong slow
de: Schiene langsam

source: Angled Base
de: Winkelstein

source: Rail Short
de: Schiene kurz

source: Tunnel Vertical
de: Tunnel vertikal

source: Drop Rail Convex
de: Lochschiene konkav

source: Drop Rail Concave
de: Lochschiene konvex

source: Zipline Begin
de: Seilbahn Start

source: Bridge Tile
de: Brückenstein

source: Curve 3x small
de: Kurve 3x klein

source: Lifter
de: Lift

source: Basic Tile
de: Basisstein

source: Spiral
de: Spirale

source: Straight with 2 Curves
de: Gerade mit 2 Kurven

source: Catapult
de: Katapult

source: Tunnel Pillar
de: Tunnelsäule

source: Loop Curve
de: Kurve mit Schleife

source: Vortex 3 in
de: Wirbel mit 3 Eingängen

source: 2x 2 in 1 left
de: 2 mal 2 in 1 links

source: Straight 3x
de: Kreuzung 3fach

source: 2 in 1 left with Curve
de: 2 in 1 links mit Kurve

source: Zipline End
de: Seilbahn Ende

source: Zipline Rail
de: Seilbahnschiene

source: Bridge Element
de: Brückenelement

source: Lift in
de: Lift Kugeleinlauf

source: Lift out
de: Lift Kugelauslauf

source: Wall Long
de: Wand lang

source: Wall Medium
de: Wand mittel

source: Wall Small
de: Wand kurz

source: Curve 2x large
de: Kurve 2x groß

source: Cross Straight and Curve
de: Gerade kreuzt Kurve

source: Carousel
de: Karussell

source: Vertical Cannon
de: Vertikale Kanone

source: 2x 2 in 1 right
de: 2 mal 2 in 1 rechts

source: 3 Curves, 2 crossing
de: Gekreuzte Kurven

source: 2 in 1 right with Curve
de: 2 in 1 rechts mit Kurve

source: Building Extension
de: Bauen Erweiterung

source: Bridges Extension
de: Brücken

source: Extension Vertical
de: Erweiterung vertikal

source: Cable Car (Zipline)
de: Seilbahn

source: Construction plan booklet
de: Bauplanheft

source: Instruction booklet
de: Beiblatt mit Beispielen

source: track
de: Bahn

source: run
de: Bahn

source: Straight Tile
de: gerader Stein

source: exit
de: stop

source: orientation
de: Orientierung

source: red
de: rote

source: green
de: grüne

source: blue
de: blaue

source: silver
de: silberne

source: gold
de: goldene

source: The current DB schema version is %1, you have only %2
de: Das derzeitige DB schema ist bei Version %1, Du hast nur Version %2

source: Upgrade the DB now?
de: Soll die DB erneuert werden

source: Y
de: J

source: to all
de: für alle

source: pos
de: Feld

source: plane
de: Platte

source: line %1
de: Zeile %1

source: %1Please enter an id from the list above
de: %1Bitte wähle eine Nummer aus obiger Liste

source: No run with id %1 existing
de: Es existiert keine Bahn mit Nummer %1

source: Please enter file name without .%1%2
de: Bitte gib einen Namen ohne .%1 an%2

source: Please enter a file name
de: Bitte gib einen Dateinamen ein

source: Name must start with an alphanum char
de: Der Dateiname muss mit einem alphanumerischen Zeichen beginnen

source: File %1 existing, overwrite it?
de: Datei %1 existiert, überschreiben?

source: Exporting %1
de: Exportiere %1

source: ENTER to write to STDOUT
de: ENTER, um nach STDOUT zu schreiben

source: really delete '%1'
de: '%1' wrklich löschen

source: Run %1 deleted
de: Anleitung für Bahn %1 gelöscht

source: id OK x*y*z title (source)
de: Nr OK x*y*z Name (Quelle)

source: List of registered marble runs
de: Liste der in der Datenbank registrierten Kugelbahnen

source: missing
de: Es fehlt

source: Field (%1, %2) is not adjacent to (%3, %4)
de: Feld (%1, 2) ist kein Nachbar von (%3, %4)

source: Direction
de: Richtung

source: Unknown board size, exiting
de: Unbekannte Zahl an Bodenplatten, Stop

source: Instructions for %1, board size %2
de: Anleitung für %1 mit %2 Bodenplatten

source: ENTER to continue without SVG output
de: oder ENTER ohne SVG

source: Incomplete data for level %1, skipping it
de: Fehlende Daten für Ebene %1, wird ignoriert

source: Place %1 %2 with center at %3
de: Lege die %1 %2 mit dem Mittelpunkt auf %3

source: At %1
de: Auf %1

source: On
de: Auf

source: with %1 bridge elements
de: mit %1 Brückenelementen

source: with %1 green parts
de: mit %1 grünen Teilen

source: with %1 transparent parts
de: mit %1 Glasteilen

source: outlet in %1
de: Auslass in %1

source: in wall %1 hole %2
de: in Wand %1 Loch %2

source: Level
de: Ebene

source: From pillar %1 at %2 to %3 %4
de: %4 von Säule %1 auf %2 nach %3

source: From %1 to %2 %3 %4
de: Von %1 nach %2 %3 %4

source: Switch state
de: Weichenstellung

source: prepare for start
de: Vorbereiten für Start

source: flap in %1
de: Klappe in %1

source: %1 should leave tile in %2
de: %1 soll Stein in %2 verlassen

source: Turntable rotor position
de: Position des Rotors

source: Unknown board size, run_id or size_x not given
de: Unbekannte Größe der Kugelbahn, run_id oder size_x nicht angegeben

source: ENTER to exit
de: ENTER für Ende

source: Created %1
de: %1 wurde erstellt

source: File size too large, exiting
de: Die Datei ist zu groß, Stop

source: Position (%1,%2) is outside of board
de: Das Feld (%1,%2) liegt außerhalb der Grundplatte

source: At %1 level %2 (%3) is already a tile %4
de: Auf %1 Ebene %2 (%3) ist bereits ein Stein %4

source: Already a tile at end point of %1
de: Auf Endpunkt %1 befindet sich schon ein Stein

source: No connection between tile %1 at %2 orientation %3 and rail %4%5
de: Keine Verbindung zwischen Stein %1 und %2 Orientierung %3 und Schiene %4%5

source: No connection to a tile from %1 at %2 orientation %3 and rail %4%5
de: Keine Verbindung zu einem Stein von %1 auf %2 Orientierung %3 und Schiene %4%5

source: Warning: height difference %1 from z=%4 at %5 for rail %2 at %3 maybe too small
de: Achtung: Höhendifferenz %1 von z=%4 für Schiene %2 auf %3 vielleicht zu klein

source: Warning: height difference %1 from z=%4 at %5 for rail %2 at %3 maybe too large
de: Achtung: Höhendifferenz %1 von z=%4 für Schiene %2 auf %3 vielleicht zu groß

source: %quant(%1,Error) found in input!
de: %quant(%1,Fehler,Fehler) im Input gefunden!

source: Checking material for %1
de: Prüfe Material für %1

source: Registering material for %1
de: Registriere Material für %1

source: You have %1 x '%2', add/store %3?
de: Du hast %1 x '%2', addiere/speichere %3?

source: stored %1 x '%2' for id %3
de: %1 x %2 für Person %3 wurde gespeichert

source: Marble run '%1' existing, replace it?
de: Kugelbahn '%1' ist schon vorhanden, ersetzen?

source: %1 already registered from %2 to %3
de: %1 von %2 nach %3 wurde bereits registriert

source: No end point for %1 from %2 to %3
de: Kein Endpunkt für %1 von %2 nach %3

source: No valid data found
de: keine gültigen Anweisungen gefunden

source: Wrong tile position '%1'
de: Falsche Feldangabe '%1' für den Stein

source: Position unknown for level %1
de: Unbekannte Position der Ebene %1

source: Only %1 height elements for plane %2 seen
de: Nur %1 Höhenelemente für Ebene %2 gesehen

source: Author
de: Autor

source: Source
de: Quelle

source: Date
de: Datum

source: Redefinition of run name '%1'
de: Run Name wurde neu definiert

source: Missing run name
de: Der Name der Bahn fehlt

source: Checking marble run '%1'
de: Kugelbahn '%1' wird getestet

source: Registering marble run '%1'
de: Kugelbahn '%1' wird gespeichert

source: Level number not given
de: Die Ebenennummerfehlt

source: Wrong level number '%1' becomes level %2
de: Falsche Nummer '%1' für Ebene wird Ebene %2

source: Level %1 already seen at %2
de: Ebene %1 schon bei %2 gesehen

source: Incorrect ground plane numbering '%1'
de: Falsche Nummerierung der Grundplatte '%1'

source: Position without further data
de: Feldangabe ohne weitere Daten

source: First position of double balcony not seen so far
de: Erste Position für Doppelbalkon bisher nicht gefunden

source: Wrong direction %1 for double balcony at %2, should be %3
de: Doppelbalkon auf %2 mit falscher Richtung %1, sollte %3 sein

source: Wrong balcony height '%1'
de: Falsche Höhenangabe %1 für Balkon

source: Wall for balcony not yet seen so far
de: Wand für Balkon bisher nicht gesehen

source: Wrong direction %1 for balcony at %2, should be %3
de: Balkon auf %2 mit falscher Richtung %1, sollte %3 sein"

source: Direction missing for element %1
de: Richtung für Balkon %1 fehlt

source: Helix must have at least 2 elements
de: Die Spirale muss aus mindestens 2 Teilen bestehen

source: Even number of elements expected, not %1
de: Eine gerade Anzahl von Elementen muss angegeben werden, nicht '%1'

source: For the mixer with orientation %1 the direction %2 of the outgoing ball is not possible
de: Für den Mixer mit Orientierung %1 ist die Richtung %2 der auslaufenden Kugel nicht möglich

source: For the releaser with orientation %1 the direction %2 of the outgoing ball is not possible
de: Für den Releaser mit Orientierung %1 ist die Richtung %2 der auslaufenden Kugel nicht möglich

source: Tile 'O' needs no height data
de: Stein O braucht keine Höhenangabe

source: %quant(%1,Excessive char) '%2'
de: %quant(%1,zusätzliches Zeichen,zusätzliche Zeichen) '%2'

source: Wrong orientation char '%1'
de: Falsches Zeichen für Orientierung: '%1'

source: %1 '%2' is not a tile
de: %1 '%2' ist kein Stein

source: Missing tile orientation for '%1'
de: Die Richtungsangabe für '%1' fehlt

source: Tile '%1' needs no orientation
de: Stein '%1' benötigt keine Orientierungsangabe

source: Wrong tile char '%1'
de: Falsches Zeichen '%1' für den Stein

source: In %1 no tile data found
de: In %1 keine Angaben zum Stein gefunden

source: Unexpected data for %1: %2
de: Unerwartete Angaben für %1: %2

source: Wrong rail char '%1'
de: Falsches Zeichen '%1' für Schiene

source: Flextube needs two directions
de: Die Flextube benötigt zwei Richtungsangaben

source: Rail %1%2: another rail in same direction already seen
de: Schiene %1%2: andere Schiene in dieser Richtung bereits vorhanden

source: Wrong rail direction '%1'
de: Falsche Richtungsangabe '%1' für Schiene

source: Missing rail direction for '%1'
de: Fehlende Richtungsangabe für Schiene %1:

source: Wrong rail data '%1'
de: Falsche Daten für Schiene

source: %1 rail data seen, %2 is maximum for tile %3
de: %1 Angaben für Schienen gesehen, maximal %2 sind für Stein %3 erlaubt

source: No marbles should be placed on the %1 tile
de: Auf dem Stein %1 sollten keine Kugeln liegen

source: Illegal%1 char %2 in %3 for marble on tile %4
de: Falsches%1 Zeichen %2 in %3 für Kugel auf Stein %4

source: marble %1 on tile %2 will be started later
de: Kugel %1 auf Stein %2 wird später gestartet

source: marble on tile %1 cannot be in position %2
de: Kugel auf Stein %1 kann nicht Orientierung %2 haben

source: Owner
de: Eigentümer

source: Unknown element %1
de: Unbekanntes Element %1

source: Ambig set name '%1': %2
de: Mehrdeutiger Bausatzname '%1': %2

source: Unknown set name '%1':
de: Unbekannter Bausatzname '%1':

source: Unknown material line '%1'
de: Unerwartete Zeile für Material '%1'

source: store a demo track in the database?
de: Speichere eine Demo Bahn in der Datenbank?

source: Export a marble run into a file
de: Schreibe die Bauanleitung für eine Kugelbahn in eine Datei

source: Delete a marble run
de: Lösche eine Bauanleitung aus der Datenbank

source: Generate SVG for a marble run
de: Generiere ein SVG Bild für die Bahn

source: Display instructions for a marble run
de: Zeige die Bauanleitung für eine Kugelbahn an

source: Usage
de: Aufruf

source: Arguments: For option -a (see below) a list of input file names can be given. Otherwise the arguments are used to select stored runs. As selection criteria the run id, a string contained in the run name, an element used in the run (1 char) or an 'OK' to select runs without missing material are possible. All criteria separated by comma must, criteria separated by white space can be fulfilled. After having selected a run an action for that run is performed, normally the instructions to build a run are printed. Then one can choose whether a SVG file should be produced. (Deleting runs can be achieved using option -d, exporting with -x). Options: -a add run or owned material from file(s) or STDIN -d delete a single run -e print a list of existing elements and its one char name -f fill all empty positions on ground plane with coordinate values (svg) -i print inventory for a person (chosen by -u or for the main user) -l lang language name for output (e.g en_US, de_de, de_DE.UTF8) -m generate svg with moving marbles (visible e.g in web browser) -n do not generate an svg image, with -a do not store run, check only -o name file name for export or svg image file prefix (without .svg) -q quiet run, do only output svg image -r coordinates are relative to ground planes (default for large runs) -s print a list of existing construction sets and its contents -u [id] chose a person to determine the available material -v verbose output -x export a single run to a file or to STDOUT -y answer always 'Y' to yes/no questions
de: Argumente: Mit Option -a (siehe unten) können Dateinamen angegeben werden Ansonsten wird mit den Argumenten eine Auswahl von gespeicherten Bahnen getroffen. Als Kriterien sind die Nummer der Bahn, eine Zeichenkette, die im Bahnnamen vorkommt, ein in der Bahn benutztes Element (1 Zeichen) oder ein OK für Bahnen ohne fehlende Elemente möglich. Durch Komma getrennte Kriterien müssen alle, durch Leerzeichen getrennte können erfüllt sein. Nach Auswahl einer Bahn erfolgt eine Aktion, normalerweise die Ausgabe der Bauanleitung, mit der Möglichkeit, eine SVG Datei zu erzeugen. Optionen: -a Speichere eine Kugelbahn oder Material aus Dateien oder von STDIN -d Lösche eine einzelne Kugelbahn -e Drucke eine Liste bekannter Elemente und das dazugehörende Symbol -f Fülle im Bild freie Felder auf der Grundplatte mit den Positionen -i Zeige das Material für eine Person (mit -u) oder den Hauptnutzer -l lang Language name für den Output (z.B en_US, de_de, de_DE.UTF8) -m erzeuge svg mit bewegten Kugeln (visible z.B im Web Browser) -n Erzeuge kein SVG Bild. Mit -a nur Test ohne Speichern von Bahnen -o name Dateiname für Export (-x) oder Präfix für SVG Datei (ohne .svg) -q Gib nur das SVG Bild aus, nicht die Bauanleitung -r Koordinaten sind auf Platte bezogen (Standard für große Bahnen) -s Drucke eine Liste bekannter Baukästen und ihrer Inhalte -u [id] Wähle eine Person aus, um das vorhandene Material zu ermitteln -v Drucke mehr Details -x Schreibe eine Kugelbahn Notation in eine Datei oder nach STDOUT -y Antworte immer 'J' auf ja/nein Fragen
